music_app/app/controllers/application_controller.rb

    def current_user
        return nil unless session[:session_token]
        current_user ||= User.find_by(session_token: session[:session_token]) # <=  #user table ST, session ST
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "PbVyPuLbGcscDkk7uSaXYg"], ["LIMIT", 1]]