music_app/app/controllers/users_controller.rb

    def show
        @user = User.find_by(params[:session_token]) #or [:id]?
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]